/*
- 연속 부분수열 1

N개의 수로 이루어진 수열이 주어집니다.
이 수열에서 연속부분수열의 합이 특정숫자 M이 되는 경우가 몇 번 있는지 구하는 프로그램을 작성하세요.
만약 N=8, M=6이고 수열이 다음과 같다면
12131112
합이 6이 되는 연속부분수열은 {2, 1, 3}, {1, 3, 1, 1}, {3, 1, 1, 1}로 총 3가지입니다.

▣ 입력설명
첫째 줄에 N(1≤N≤100,000), M(1≤M≤100,000,000)이 주어진다. 수열의 원소값은 1,000을 넘지 않는 자연수이다.

▣ 출력설명
첫째 줄에 경우의 수를 출력한다.
*/

const solution = (n, m, array) => {
  let answer = 0;
  let p1 = 0; // 처음 탐색한 숫자 인덱스
  let p2 = 0; // 탐색할 인덱스
  let sum = 0;
  while (p1 < n) {
    if (sum < m) {
      if (p2 < n) sum += array[p2++];
      else {
        sum = 0;
        p1++;
        p2 = p1;
      }
    }
    if (sum === m) {
      answer++;
      sum = 0;
      p1++;
      p2 = p1;
    }
    if (sum > m) {
      sum = 0;
      p1++;
      p2 = p1;
    }
  }
  return answer;
};

console.log(solution(8, 6, [1, 2, 1, 3, 1, 1, 1, 2]));
